<html>
<head>
<style type="text/css"></style>
<link href="tutorials.css" rel="stylesheet" type="text/css">
<style type="text/css"></style>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"><title>mpk_TextureMap</title>
</head>
<body class="style1">
<div align="center">
<table width="800" border="0" cellspacing="0" cellpadding="0">
<tr>
  <td align="left">
  <p class="headline">&#1058;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1085;&#1099;&#1077; &#1082;&#1072;&#1088;&#1090;&#1099; &#1074; mpk.</p>
  <p class="overall">&#1052;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1082; mesh-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084; &#1074; mpk &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;, &#1080;&#1084;&#1077;&#1102;&#1090;  &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093; &#1089;&#1083;&#1086;&#1090;&#1072;:</p>
  <p class="overall">colormap(diffuse)<br>
    lightmap<br>
    blendmap<br>
    alphamap</p>
  <p class="overall">&#1042; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; colormap &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;, lightmap, blendmap &#1080; alphamap &#1079;&#1072;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;  &#1087;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;. &#1048;&#1079; 3dsmax &#1074; mpk &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100;  &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1099; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; colormap  &#1089;&#1083;&#1086;&#1090;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1077;&#1088; <a href="PK_3dsmax/exe/ase2mpk.exe" class="reference">ase2mpk</a> &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1086;&#1073;&#1097;&#1091;&#1102; &#1082;&#1072;&#1088;&#1090;&#1091;  &#1086;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084; mesh-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1089;&#1083;&#1086;&#1090;&#1072;&#1084;&#1080;  &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1089;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; <a href="PK_3dsmax/exe/blend.exe" class="reference">blend.exe</a>. </p>
  <p class="overall">&#1055;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084; &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1086;&#1090;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1079;&#1085;&#1072;&#1090;&#1100; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;  &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093;:</p>
  <p class="overall">colormap  - &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082;.<br>
  lightmap - &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;.<br>
  blendmap - &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; mesh-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1085;&#1072;&#1088;&#1072;&#1074;&#1085;&#1077;  &#1089; colormap &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1086;&#1081;.<br>
  alphamap - (&#1084;&#1072;&#1089;&#1082;&#1072;) &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1072; &#1074; &#1086;&#1090;&#1090;&#1077;&#1085;&#1082;&#1072;&#1093; &#1089;&#1077;&#1088;&#1086;&#1075;&#1086; - &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;  &#1074;&#1079;&#1072;&#1080;&#1084;&#1085;&#1091;&#1102; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; colormap &#1080; blendmap. &#1045;&#1089;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1072; &#1084;&#1072;&#1089;&#1082;&#1080; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1080;&#1083;&#1080;  &#1080;&#1084;&#1077;&#1077;&#1090; &#1095;&#1105;&#1088;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;, &#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1080;&#1076;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; colormap &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1072;.</p>
  <p>&nbsp;</p>
  <p class="headline">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1075;&#1086; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072;.</p>
  <p class="overall">&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1080;&#1076;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091;  &#1074;&#1080;&#1076; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086;  &#1085;&#1072;&#1073;&#1083;&#1102;&#1076;&#1072;&#1090;&#1100; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1077; DM_Unseen. </p>
  <p align="center"><img src="img/TextMap/Shot0000.gif" width="800" height="500"></p>
  <p class="overall">&#1069;&#1092;&#1092;&#1077;&#1082;&#1090; &#1087;&#1083;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1086;&#1090; &#1089;&#1087;&#1083;&#1086;&#1096;&#1085;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1099; &#1082; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1081;,  &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1092;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088; &#1074;&#1089;&#1077;&#1093; &#1095;&#1077;&#1090;&#1099;&#1088;&#1105;&#1093; &#1089;&#1083;&#1086;&#1090;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;  &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;:</p>
  <p class="overall">1. &#1042;&#1089;&#1077; &#1089;&#1083;&#1086;&#1090;&#1099; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1099;.<br>
  2. &#1057;&#1072;&#1084;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &quot;&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099;&quot; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;.<br>
  3. &#1052;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1096;&#1077;&#1081;&#1076;&#1077;&#1088;&#1086;&#1084;. </p>
  <p class="overall"><span class="style1bold">&#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;</span>. <br>
&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1079;&#1085;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1080;&#1079; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093;  &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1090;&#1086;&#1090; &#1080;&#1083;&#1080; &#1080;&#1085;&#1086;&#1081; &#1089;&#1083;&#1086;&#1090;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1091;&#1077;&#1084;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081;  &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;&#1081;.</p>
  <table width="266" border="2" align="center" cellspacing="2">
    <tbody>
      <tr>
        <td width="124"><font color="#000000" size="3" face="times new roman,times">&nbsp;colormap</font></td>
        <td width="124"><font color="#000000" size="3" face="times new roman,times">&nbsp;1-&#1081; UV-&#1082;&#1072;&#1085;&#1072;&#1083;</font></td>
      </tr>
      <tr>
        <td><font color="#000000" size="3" face="times new roman,times">&nbsp;lightmap</font></td>
        <td><font color="#000000" size="3" face="times new roman,times">&nbsp;2-&#1081; UV-&#1082;&#1072;&#1085;&#1072;&#1083;</font></td>
      </tr>
      <tr>
        <td><font color="#000000" size="3" face="times new roman,times">&nbsp;blendmap</font></td>
        <td><font color="#000000" size="3" face="times new roman,times">&nbsp;1-&#1081; UV-&#1082;&#1072;&#1085;&#1072;&#1083;</font></td>
      </tr>
      <tr>
        <td><font color="#000000" size="3" face="times new roman,times">&nbsp;alphamap</font></td>
        <td><font color="#000000" size="3" face="times new roman,times">&nbsp;2-&#1081; UV-&#1082;&#1072;&#1085;&#1072;&#1083;</font></td>
      </tr>
    </tbody>
  </table>
  <p class="overall">&#1053;&#1077; &#1073;&#1091;&#1076;&#1077;&#1084; &#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; colormap &#1080; lightmap, &#1080;&#1093; &#1074;&#1080;&#1076; &#1080; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;, &#1076;&#1091;&#1084;&#1072;&#1102;, &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1085;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;. &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;  &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1083;&#1080;&#1096;&#1100; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; colormap  &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1080;&#1084;&#1077;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; RGB &#1082;&#1072;&#1085;&#1072;&#1083;&#1099;. &#1040; &#1074;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1088;&#1086;&#1083;&#1100;  blendmap &#1080; alphamap &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1080;&#1093; &#1086;&#1073;&#1088;&#1072;&#1079;&#1094;&#1099; &#1080;  &#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; &#1074; Photoshop-&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;.</p>
  <p align="center"><img src="img/TextMap/blendmap.gif" width="518" height="269"></p>
  <p align="center" class="headline">blendmap</p>
  <p align="center"><img src="img/TextMap/alphamap.gif" width="528" height="289"></p>
  <p align="center" class="headline">alphamap</p>
  <p class="overall">&#1050;&#1072;&#1082; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1090;&#1088;&#1105;&#1093; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1099;&#1093; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074;, &#1101;&#1090;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1099; &#1080;&#1084;&#1077;&#1102;&#1090;  4-&#1081; &ndash; &#1072;&#1083;&#1100;&#1092;&#1072;-&#1082;&#1072;&#1085;&#1072;&#1083;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; &quot;&#1084;&#1072;&#1089;&#1082;&#1077;&quot; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1090;&#1100; &#1087;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;  &#1075;&#1088;&#1072;&#1076;&#1072;&#1094;&#1080;&#1102; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1081; &#1074; &#1072;&#1083;&#1100;&#1092;&#1072;-&#1082;&#1072;&#1085;&#1072;&#1083;&#1077;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1091; &#1074; &#1092;&#1072;&#1081;&#1083;, &#1087;&#1086;&#1084;&#1085;&#1080;&#1084; &#1086; &#1090;&#1086;&#1084;,  &#1095;&#1090;&#1086; 1 bit alpha &#1085;&#1072;&#1084; &#1085;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090;. &#1053;&#1091;&#1078;&#1077;&#1085; explicit alpha &#1080;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086;&#1077;. <br>
  &nbsp;<br>
  <span class="style1bold">&#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1085;&#1091;&#1078;&#1085;&#1099;&#1081; &#1096;&#1077;&#1081;&#1076;&#1077;&#1088;</span> &#1080; &#1079;&#1072;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1083;&#1100;&#1092;&#1072; &#1082;&#1072;&#1085;&#1072;&#1083;&#1099;,  &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; mesh-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &quot;trans&quot;. <br>
  <span class="style1bold">&#1053;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1083;&#1086;&#1090;&#1099;</span> &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;  &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; <a href="PK_3dsmax/exe/blend.exe" class="reference">blend.exe</a>. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1087;&#1086;&#1080;&#1084;&#1105;&#1085;&#1085;&#1086; &quot;&#1087;&#1077;&#1088;&#1077;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&quot; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1074;  &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; (dm_temp.mpk) &#1080; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1080;&#1084;&#1105;&#1085; &#1080;&#1097;&#1077;&#1090; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; Obj.txt.  &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1086;, &#1090;&#1086; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077;  &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1081; &#1085;&#1077;&#1090; - &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;  &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1092;&#1072;&#1081;&#1083; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; dm_temp_blend.mpk. </p>
  <p class="overall"><span class="style1bold">&#1053;&#1072; &#1095;&#1090;&#1086; &#1079;&#1076;&#1077;&#1089;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;?</span> <br>
    <span class="style1bold">&#1042;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;</span>, &#1085;&#1072; &#1080;&#1084;&#1077;&#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; mpk &#1092;&#1072;&#1081;&#1083; &#1073;&#1099;&#1083; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1089;  &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="PK_3dsmax/exe/ase2mpk.exe" class="reference">ase2mpk</a>, &#1090;&#1086; &#1074;&#1089;&#1077; &#1073;&#1091;&#1082;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1074; &#1080;&#1084;&#1077;&#1085;&#1072;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; mpk  &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1074; &#1082;&#1072;&#1082;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1073;&#1099;&#1083;&#1080; &#1101;&#1090;&#1080;  &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1074; 3dsmax. <a href="PK_3dsmax/exe/blend.exe" class="reference">Blend.exe</a>  &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&nbsp; &#1080;&#1084;&#1103; Plane01 &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084; &#1086;&#1090;  &#1080;&#1084;&#1077;&#1085;&#1080; plane01.<br>
    <span class="style1bold">&#1042;&#1086;-&#1074;&#1090;&#1086;&#1088;&#1099;&#1093;</span>, &#1085;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1072;&#1084; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;,  &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1077; &#1089; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080; &#1089;&#1072;&#1084;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. <br>
    <span class="style1bold">&#1042;-&#1090;&#1088;&#1077;&#1090;&#1100;&#1080;&#1093;</span>, &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1093;&#1086;&#1090;&#1080;&#1084;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;  &#1082;&#1072;&#1088;&#1090;&#1091; &#1086;&#1089;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1103; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; blendmap &#1080; alphamap, &#1090;&#1086; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1080;&#1093;  &#1054;&#1041;&#1071;&#1047;&#1040;&#1058;&#1045;&#1051;&#1068;&#1053;&#1054; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;:</p>
  <p><span id="codeMessage">
  object_name<br>
  0.000000<br>
  0.000000<br>
  1.000000<br>
  1.000000<br>
  new_lightmap_name<br>
  <br>
  0.000000<br>
  0.000000<br>
  1.000000<br>
  1.000000<br>
  <br>
  </span></p>
  <p class="overall">&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1090; &#1094;&#1080;&#1092;&#1088;&#1099; 0.000000 &#1080; 1.000000 &#1074;  Obj.txt. &#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1084;&#1077;&#1085;&#1080; - &#1101;&#1090;&#1086; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087; (offset) &#1080; &#1082;&#1086;&#1101;&#1092;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1077;&#1085;&#1080;&#1103;  (tile) &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1076;&#1083;&#1103; colormap  &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1099;, &#1074;&#1090;&#1086;&#1088;&#1072;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; - &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1076;&#1083;&#1103; blendmap.</p>
  <p class="overall">&#1053;&#1091; &#1080;, &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1095;&#1090;&#1086;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1086;&#1084;  &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1074;&#1072; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;.</p>
  <p class="overall">&#1057;&#1072;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1099;  dm_temp.mpk, Obj.txt &#1080; <a href="PK_3dsmax/exe/blend.exe" class="reference">blend.exe</a> &#1074; &#1086;&#1076;&#1085;&#1091; &#1087;&#1072;&#1087;&#1082;&#1091; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;.  &#1055;&#1086;&#1089;&#1083;&#1077; &#1095;&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1091; - dm_temp_blend.mpk &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1086;&#1077; &#1080;&#1084;&#1103;.</p>
  <p class="overall"><span class="style1bold">&#1042; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;</span>:<br>
    <span class="overall">&#1057;&#1086;&#1079;&#1076;&#1072;&#1105;&#1084; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1100;.</span></p>
  <p align="center"><img src="img/TextMap/max1.gif" width="707" height="507"></p>
  <p class="overall">&#1043;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1085;&#1099;&#1077; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; UV-&#1082;&#1072;&#1085;&#1072;&#1083;&#1077;.</p>
  <p align="center"><img src="img/TextMap/max2.gif" width="707" height="507"></p>
  <p class="overall">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1086;&#1081; &#1074; diffuse &#1089;&#1083;&#1086;&#1090;&#1077;.</p>
  <p align="center"><img src="img/TextMap/max3.gif" width="367" height="519"></p>
  <p class="overall">&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1074; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &quot;trans&quot;.</p>
  <p align="center"><img src="img/TextMap/max4.gif" width="707" height="507"></p>
  <p class="overall">&#1044;&#1072;&#1083;&#1077;&#1077; &#1082;&#1083;&#1072;&#1076;&#1105;&#1084; <a href="img/TextMap/dm_temp.exe" class="reference">&#1079;&#1072;&#1088;&#1072;&#1085;&#1077;&#1077; &#1087;&#1088;&#1080;&#1075;&#1086;&#1090;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1099;</a> &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; Data\Textures\Levels\dm_temp.<br>
    &#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1080; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1090;&#1072;&#1082;:</p>
  <p align="center"><img src="img/TextMap/noblend.gif" width="800" height="500"></p>
  <p class="overall">&#1040; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084; <a href="PK_3dsmax/exe/blend.exe" class="reference">blend.exe</a> &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086; &#1089; Obj.txt &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1103;:</p>
  <p><span id="codeMessage">
  plane01_trans<br>
  0.000000<br>
  0.000000<br>
  5.000000<br>
  5.000000<br>
  my_lightmap<br>
  my_blendmap<br>
  0.000000<br>
  0.000000<br>
  1.000000<br>
  1.000000<br>
  my_alphamask<br>
  </span></p>
  <p class="overall">&#1042; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1080;&#1090;&#1086;&#1075;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;:</p>
  <p align="center"><img src="img/TextMap/blend.gif" width="800" height="500"></p></td>
</tr>
</table>
<p>&nbsp;</p>
</div>
</body>
</html>